<script setup lang="ts">
import MainLayout from '@/layouts/MainLayout.vue'
import PostMenu from '@/components/PostMenu.vue'
import CreateComment from '@/components/CreateComment.vue'
import SortComp from '@/components/SortComp.vue'
import PersonalComment from '@/components/PersonalComment.vue'
</script>
<template>
    <MainLayout>
        <article
            class="flex flex-col basis-9/12 gap-4 p-4 bg-bgSoft-light dark:bg-bgSoft-dark border rounded border-divider-light dark:border-divider-dark"
        >
            <!-- Header -->
            <section>
                <p class="text-xs text-textSecondary-light dark:text-textSecondary-dark">
                    <!-- Category -->
                    <span class="text-textPrimary-light dark:text-textPrimary-dark font-bold">
                        Lifestyle
                    </span>
                    • Posted by Weroniczka/@66025010 7d
                </p>
                <!-- Title -->
                <h1 class="text-2xl font-bold text-textPrimary-ligth dark:text-textPrimary-dark">
                    คนที่เรียนไปด้วย ทำงานไปด้วย ทำยังไงให้เอาชีวิตรอดได้จนจบคะ ถ้าไม่มีใคร support
                    เลย
                </h1>
            </section>

            <!-- Image -->
            <section>
                <img v-if="image" :src="image" class="max-h-80 w-full object-cover" />
            </section>

            <!-- Body -->
            <section>
                <p
                    v-html="replaceBrTags"
                    class="text-textSecondary-light dark:text-textSecondary-dark"
                ></p>
            </section>

            <!-- Post menu -->
            <PostMenu />

            <!-- Create comment -->
            <CreateComment />

            <!-- Sorting comment -->
            <SortComp />

            <!-- Comment(s)  -->
            <section class="flex flex-col gap-4">
                <PersonalComment
                    content="ผมชื่นชมคนที่ส่งตัวเองเรียนนะครับ ลองมองโลกในแง่ดีครับว่าสิ่งเหล่านี้ยิ่งจะเป็นสิ่งที่ทำให้เราเข้มแข็งมากๆครับ ซึ่งผมค่อนข้างสบายครับ มีคนซัพพอร์ทให้ตลอด จนตอนนี้รู้่สึกว่ายังไม่ค่อยตระหนักถึงความยากลำบากของการหาเงิน ทำให้ผมเก็บเงินไม่ค่อยเก่ง แรงกระตือรือร้นในการหาเงินก็ไม่ค่อยสูง (แต่ตอนนี้เริ่มอยากมีเงินแล้วครับ) ผมคิดว่ามันจะทำให้เติบโตอย่างเข้มแข็งนะ ต่อมาอาจทำให้กลายเป็นคนหาเงินเก่ง อยู่กับความเป็นจริงสูงน่ะครับ ปัญหาทุกทางมีทางออกนะครับ ค่อยๆคิดค่อยๆทำ อดทนสู้ๆครับ"
                />
                <PersonalComment
                    content="เราก็เป็นคนหนื่งนะที่เรียนไปด้วยทำงานไปด้วย เราเริ่มต้นจากการเรียนต่อ ปวส. ก่อน 2 ปี พอเราเรียนจบ ปวส. แล้วเรียนต่อ ป.ตรี อีก 2 ปี ยอมรับว่าค่อนข้างเหนื่อยมาก เพราะวันปกติไปทำงาน ส่วนวันอาทิตย์ไปเรียน ค่าใช้จ่ายก็ค่อนข้างสูงเหมือนกัน ต้องประหยัดจริง ถึงจะพอกินเพราะเราไม่ได้รวยจึงต้องหาตังค์เรียนเอง แต่เราว่าทำงานไปด้วย เรียนไปด้วยมันทำให้เราแกร่งขึ้นนะ มีความอดทนมากกว่าคนอื่นๆเลยล่ะ ใครที่เรียนไปด้วยทำงานไปด้วย สู้ๆนะคะ"
                />
                <PersonalComment
                    content="เราเรียนด้วยทำงานด้วย ตั้งแต่มหาลัยปี 1 ค่ะ ตื่นเช้า 6 โมง เข้างาน 8 โมง เลิกงาน 5 โมง เข้าเรียน 6 โมง เลิกเรียน 3 ทุ่ม ทำงาน 6 วัน จันทร์ถึงเสาร์ เรียน 5 วัน อังคารถึงเสาร์ วันอาทิตย์ส่วนมากต้องไปเรียนเพิ่มเพราะเวลาเรียนไม่พออีกค่ะ ตอนนี้ก็ทำงานมาได้ 3 ปีกว่า เรียนตอนนี้อยู่ปี 4 กำลังจะสอบ Final ครั้งสุดท้ายเดือนหน้านี้ อยากเป็นกำลังใจให้ทุกคนที่เรียนด้วยทำงานด้วยทุกคน มันเหนื่อยมากจริงๆคนที่สามารถผ่านไปได้ ไม่จำเป็นต้องเก่ง แต่ต้องขยันค่ะ สู้ๆนะคะ"
                />
            </section>
        </article>
    </MainLayout>
</template>
<script lang="ts">
export default {
    data() {
        return {
            post: {
                content: `ถ้ามีเงื่อนไขในชีวิตว่า แม่ทำงานได้วันละไม่ถึง 200 บาท น้องไม่ได้ทำงาน ไม่มีญาติช่วยเหลือ ตัวเองต้องทำงานหาเงินเพื่อที่จะมีให้ตัวเองได้กินข้าว ซื้อของอุปโภคบริโภคภายในครอบครัว ไหนจะค่าเรียนอีก จ่ายค่าเทอมเองทุกบาท ค่ารถไปบางทีเราก็ไม่ได้ไปสอบเพราะวันนั้นไม่มีค่ารถไป แล้วต้องขาดงานทำให้เสียรายได้อีก แค่สามร้อยกว่าบาทก็ทำให้ชีวิตมีกินมีใช้หลายวันแล้ว ลาสามวันเราก็ขาดรายได้รวมสิ้นเดือนพันกว่าบาทแล้ว มีใครผ่านแบบนี้ไปได้ไหมคะ จะทำยังไงดี เหมือนเรียนยังไงก็จะไม่จบซักที ไปสอบได้แค่ทีละตัวสองตัวแล้วก็จะเป็นอย่างนี้อยู่ตลอดไป เพราะแม่ยังหาแค่กินไปวันๆ สามคนยังไม่พอเลย ไหนจะต้องน้องอีก แล้วยังทำให้ต้องท้อใจ ไม่เคยช่วยเหลือ แม้แต่ซักผ้าเอง บอกให้แม่สอน ก็ไม่สอน แล้วยังมาเฆี่ยนเอากับเรา ว่าเราเป็นพี่ เราต้องให้ๆๆๆ ให้เท่าไหร่ก็ไม่พอ ให้เท่าไหร่ก็ไม่เคยคิดที่จะช่วยเหลือตัวเอง (แล้วเราก็ขอทุนไม่ได้ ขอ กยศ. ไม่ได้ เพราะไม่ได้ลงเรียนเต็มรายวิชา และทำงาน หมดหวังจริงๆ) (เราไม่เคยแต่งหน้าเลย เพราะถ้าซื้อเครื่องสำอางเราต้องอดกินข้าวแน่ๆ ไม่แต่งตัว ไม่ใส่นาฬิกาเหมือนเพื่อนๆ คือประหยัดสุดๆแล้ว ค่าเน็ตก็ใช้ true bonus เน็ตฟรี) แทบไม่ต้องหวังว่าเมื่อไหร่จะได้ไปเข้าเรียน เมื่อไหร่จะได้ไปสอบครบ เมื่อไหร่จะได้ซ่อมบ้าน เมื่อไๆหร่จะได้มีเงินเอาไปลงทุนขายของหรือทำอย่างอื่น เมื่อไหร่จะมีอนาคต ไม่มีทางออกเลยค่ะ ไม่ไหวแล้วค่ะ มากกว่าท้อ มากกว่าเครียด คือมองไม่เห็นทางออก ไม่มีที่ปรึกษา ทำอะไรไม่ได้เลย`
            }
        }
    },
    props: {
        image: {
            type: String,
            default: ''
        },
        content: {
            type: String,
            default: ''
        }
    },
    computed: {
        replaceBrTags() {
            return this.post.content.replace(/\n/g, '<br>')
        }
    }
}
</script>
